In [1]:
import pandas as pd
import numpy as np
from pathlib import Path
# dates & cleaning
import re
import warnings
warnings.filterwarnings("ignore")
# optional: show full tables in console
pd.set_option("display.max_columns", None)
pd.set_option("display.width", 120)

In [4]:
students_file = "../DATA/Students per education type Amsterdam.csv"

In [5]:
students = pd.read_csv(students_file, sep=";")

In [6]:
students.head()

,Unnamed: 0,Unnamed: 1,Students,Students.1,Students.2,Students.3,Students.4,Students.5,Students.6,Students.7,Students.8,Students.9,Students.10,Students.11,Students.12,Students.13
0,Period,NaN,2011/'12,2012/'13,2013/'14,2014/'15,2015/'16,2016/'17,2017/'18,2018/'19,2019/'20,2020/'21,2021/'22,2022/'23,2023/'24,2024/'25*
1,Education type,Age (approx),#,#,#,#,#,#,#,#,#,#,#,#,#,#
2,Primary education,4-12 years,61180,61620,62420,63110,63570,63450,62810,62580,62300,61150,59660,58390,59640,58770
3,Secundary eduction for special needs childeren,12-17 years,2810,2680,2780,2690,2570,2530,2600,2650,2680,2680,2730,2740,2760,2740
4,Secundary education,12-17 years,32950,33960,34770,35550,36350,36690,37240,37510,37960,38090,38570,39360,40740,40580

In [7]:
years = students.iloc[0, 2:]
students_clean = students.iloc[2:].copy()

In [9]:
students_clean.columns = ["education_type", "age_group"] + list(years)

In [13]:
students_clean.head(7)

,education_type,age_group,2011/'12,2012/'13,2013/'14,2014/'15,2015/'16,2016/'17,2017/'18,2018/'19,2019/'20,2020/'21,2021/'22,2022/'23,2023/'24,2024/'25*
2,Primary education,4-12 years,61180,61620,62420,63110,63570,63450,62810,62580,62300,61150,59660,58390,59640,58770
3,Secundary eduction for special needs childeren,12-17 years,2810,2680,2780,2690,2570,2530,2600,2650,2680,2680,2730,2740,2760,2740
4,Secundary education,12-17 years,32950,33960,34770,35550,36350,36690,37240,37510,37960,38090,38570,39360,40740,40580
5,Secundary education for adults,17+ years,360,320,870,860,890,930,970,980,920,630,800,810,1010,920
6,Vocational education,16+ years,18760,18030,17780,16840,16540,16610,16570,16910,16930,17640,17810,16780,16560,16350
7,University of applied sciences (bachelor),17+ years,24170,24030,25770,25990,26000,25340,24290,23230,23120,24700,25550,24600,24490,23580
8,University (masters),18+ years,30290,29210,30670,31010,30470,29530,29270,30450,31630,33980,36420,37970,39670,37710

In [14]:
students_clean = students_clean.drop(columns="age_group")

In [15]:
students_long = students_clean.melt(
    id_vars="education_type",
    var_name="year",
    value_name="students"
)

In [16]:
students_long["students"] = students_long["students"].astype(int)

In [17]:
students_long["students"] = pd.to_numeric(students_long["students"], errors="coerce")
students_long = students_long.dropna(subset=["students"])
students_long["students"] = students_long["students"].astype(int)

In [18]:
students_long["year"] = (
    students_long["year"]
    .astype(str)
    .str.replace(r"\D", "", regex=True)   # keep only digits
    .str[-2:]                             # last two digits
    .astype(int) + 2000
)

In [19]:
students_long.head()

                                   education_type  year  students
0                              Primary education   2012     61180
1  Secundary eduction for special needs childeren  2012      2810
2                             Secundary education  2012     32950
3                  Secundary education for adults  2012       360
4                            Vocational education  2012     18760

In [ ]:
students_long.to_csv("../data_clean/students.csv", index=False)